
## :x: Apply Failed





It failed to parse the result.

<details><summary>Details (Click me)</summary>

```hcl
data.google_storage_bucket.kyma_prow_logs: Reading...
data.google_secret_manager_secret.common_slack_bot_token: Reading...
data.google_project.project: Reading...
data.google_secret_manager_secret.gh_tools_kyma_bot_token: Reading...
data.google_storage_bucket.kyma_prow_logs: Read complete after 0s [id=kyma-prow-logs]
data.google_secret_manager_secret.common_slack_bot_token: Read complete after 1s [id=projects/sap-kyma-prow/secrets/common-slack-bot-token]
data.google_secret_manager_secret.gh_tools_kyma_bot_token: Read complete after 1s [id=projects/sap-kyma-prow/secrets/trusted_default_kyma-bot-github-sap-token]
data.google_project.project: Read complete after 1s [id=projects/sap-kyma-prow]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.google_iam_policy.run_invoker will be read during apply
  # (config refers to values not yet known)
 <= data "google_iam_policy" "run_invoker" {
      + id          = (known after apply)
      + policy_data = (known after apply)

      + binding {
          + members = [
              + (known after apply),
            ]
          + role    = "roles/run.invoker"
        }
    }

  # data.template_file.scan_logs_for_secrets_yaml will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "scan_logs_for_secrets_yaml" {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = <<-EOT
            main:
              params: [ event ]
              steps:
                - check:
                    call: json.decode
                    args:
                      data: $${event.data.message.data}
                    result: step_result
                - check_if_prowjob_finished:
                    switch:
                      - condition: $${step_result.status in ["success", "failure", "aborted"]}
                        steps:
                          - search_secrets_leaks_in_logs:
                              call: http.post
                              args:
                                url: ${scan-logs-for-secrets-url}
                                auth:
                                  type: OIDC
                                headers:
                                  Content-Type: "application/cloudevents+json"
                                body: $${event}
                              result: step_result
                          - check_if_leaks_found:
                              switch:
                                - condition: $${step_result.body.type == "prowjob.logs.leaks.found"}
                                  steps:
                                    - move_gcs_bucket:
                                        call: http.post
                                        args:
                                          url: ${move-gcs-bucket-url}
                                          auth:
                                            type: OIDC
                                          headers:
                                            Content-Type: "application/cloudevents+json"
                                            X-Cloud-Trace-Context: $${map.get(step_result.headers, "X-Cloud-Trace-Context")}
                                          body: $${step_result.body}
                                        result: step_result
                                    - search_github_issues:
                                        call: http.post
                                        args:
                                          url: ${search-github-issue-url}
                                          auth:
                                            type: OIDC
                                          headers:
                                            Content-Type: "application/cloudevents+json"
                                            X-Cloud-Trace-Context: $${map.get(step_result.headers, "X-Cloud-Trace-Context")}
                                          body: $${step_result.body}
                                        result: step_result
                                    - check_if_issue_found:
                                        switch:
                                          - condition: $${step_result.body.type == "sap.tools.github.leakissue.notfound"}
                                            steps:
                                              - create_github_issue:
                                                  call: http.post
                                                  args:
                                                    url: ${create-github-issue-url}
                                                    auth:
                                                      type: OIDC
                                                    headers:
                                                      Content-Type: "application/cloudevents+json"
                                                      X-Cloud-Trace-Context: $${map.get(step_result.headers, "X-Cloud-Trace-Context")}
                                                    body: $${step_result.body}
                                                  result: step_result
                                              - send_slack_message:
                                                  call: http.post
                                                  args:
                                                    url: ${send-slack-message-url}/secret-leak-found
                                                    auth:
                                                      type: OIDC
                                                    headers:
                                                      Content-Type: "application/cloudevents+json"
                                                      X-Cloud-Trace-Context: $${map.get(step_result.headers, "X-Cloud-Trace-Context")}
                                                    body: $${step_result.body}
                                                  result: step_result
                                                  next: return_result
                                        next: return_result
                              next: return_result
                          - return_result:
                              return: $${step_result}
                    next: end
        EOT
      + vars     = {
          + "create-github-issue-url"   = (known after apply)
          + "move-gcs-bucket-url"       = (known after apply)
          + "scan-logs-for-secrets-url" = (known after apply)
          + "search-github-issue-url"   = (known after apply)
          + "send-slack-message-url"    = (known after apply)
        }
    }

  # google_cloud_run_service.gcs_bucket_mover will be created
  + resource "google_cloud_run_service" "gcs_bucket_mover" {
      + autogenerate_revision_name = false
      + id                         = (known after apply)
      + location                   = "europe-west3"
      + name                       = "gcs-bucket-mover"
      + project                    = (known after apply)
      + status                     = (known after apply)

      + metadata {
          + annotations      = {
              + "run.googleapis.com/client-name" = "terraform"
            }
          + generation       = (known after apply)
          + labels           = (known after apply)
          + namespace        = (known after apply)
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }

      + template {
          + metadata {
              + annotations      = (known after apply)
              + generation       = (known after apply)
              + labels           = (known after apply)
              + name             = (known after apply)
              + namespace        = (known after apply)
              + resource_version = (known after apply)
              + self_link        = (known after apply)
              + uid              = (known after apply)
            }

          + spec {
              + container_concurrency = (known after apply)
              + service_account_name  = (known after apply)
              + serving_state         = (known after apply)
              + timeout_seconds       = (known after apply)

              + containers {
                  + image = "europe-docker.pkg.dev/kyma-project/prod/test-infra/movegcsbucket:v20230202-40569193"

                  + env {
                      + name  = "APPLICATION_NAME"
                      + value = "secrets-leaks-detector"
                    }
                  + env {
                      + name  = "COMPONENT_NAME"
                      + value = "gcs-bucket-mover"
                    }
                  + env {
                      + name  = "DST_BUCKET_NAME"
                      + value = "dev-prow-logs-secured"
                    }
                  + env {
                      + name  = "LISTEN_PORT"
                      + value = "8080"
                    }
                  + env {
                      + name  = "PROJECT_ID"
                      + value = "sap-kyma-prow"
                    }

                  + ports {
                      + container_port = (known after apply)
                      + name           = (known after apply)
                      + protocol       = (known after apply)
                    }

                  + resources {
                      + limits   = (known after apply)
                      + requests = (known after apply)
                    }
                }
            }
        }

      + traffic {
          + latest_revision = (known after apply)
          + percent         = (known after apply)
          + revision_name   = (known after apply)
          + tag             = (known after apply)
          + url             = (known after apply)
        }
    }

  # google_cloud_run_service.github_issue_creator will be created
  + resource "google_cloud_run_service" "github_issue_creator" {
      + autogenerate_revision_name = false
      + id                         = (known after apply)
      + location                   = "europe-west3"
      + name                       = "github-issue-creator"
      + project                    = (known after apply)
      + status                     = (known after apply)

      + metadata {
          + annotations      = {
              + "run.googleapis.com/client-name" = "terraform"
            }
          + generation       = (known after apply)
          + labels           = (known after apply)
          + namespace        = (known after apply)
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }

      + template {
          + metadata {
              + annotations      = (known after apply)
              + generation       = (known after apply)
              + labels           = (known after apply)
              + name             = (known after apply)
              + namespace        = (known after apply)
              + resource_version = (known after apply)
              + self_link        = (known after apply)
              + uid              = (known after apply)
            }

          + spec {
              + container_concurrency = (known after apply)
              + service_account_name  = (known after apply)
              + serving_state         = (known after apply)
              + timeout_seconds       = (known after apply)

              + containers {
                  + image = "europe-docker.pkg.dev/kyma-project/prod/test-infra/creategithubissue:v20230207-d59daeb0"

                  + env {
                      + name  = "APPLICATION_NAME"
                      + value = "github-kyma-bot"
                    }
                  + env {
                      + name  = "COMPONENT_NAME"
                      + value = "github-issue-creator"
                    }
                  + env {
                      + name  = "GITHUB_ORG"
                      + value = "neighbors-team"
                    }
                  + env {
                      + name  = "GITHUB_REPO"
                      + value = "leaks-test"
                    }
                  + env {
                      + name  = "LISTEN_PORT"
                      + value = "8080"
                    }
                  + env {
                      + name  = "PROJECT_ID"
                      + value = "sap-kyma-prow"
                    }
                  + env {
                      + name  = "TOOLS_GITHUB_TOKEN_PATH"
                      + value = "/etc/gh-token/trusted_default_kyma-bot-github-sap-token"
                    }

                  + ports {
                      + container_port = (known after apply)
                      + name           = (known after apply)
                      + protocol       = (known after apply)
                    }

                  + resources {
                      + limits   = (known after apply)
                      + requests = (known after apply)
                    }

                  + volume_mounts {
                      + mount_path = "/etc/gh-token"
                      + name       = "gh-tools-kyma-bot-token"
                    }
                }

              + volumes {
                  + name = "gh-tools-kyma-bot-token"

                  + secret {
                      + secret_name = "trusted_default_kyma-bot-github-sap-token"
                    }
                }
            }
        }

      + traffic {
          + latest_revision = (known after apply)
          + percent         = (known after apply)
          + revision_name   = (known after apply)
          + tag             = (known after apply)
          + url             = (known after apply)
        }
    }

  # google_cloud_run_service.github_issue_finder will be created
  + resource "google_cloud_run_service" "github_issue_finder" {
      + autogenerate_revision_name = false
      + id                         = (known after apply)
      + location                   = "europe-west3"
      + name                       = "github-issue-finder"
      + project                    = (known after apply)
      + status                     = (known after apply)

      + metadata {
          + annotations      = {
              + "run.googleapis.com/client-name" = "terraform"
            }
          + generation       = (known after apply)
          + labels           = (known after apply)
          + namespace        = (known after apply)
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }

      + template {
          + metadata {
              + annotations      = (known after apply)
              + generation       = (known after apply)
              + labels           = (known after apply)
              + name             = (known after apply)
              + namespace        = (known after apply)
              + resource_version = (known after apply)
              + self_link        = (known after apply)
              + uid              = (known after apply)
            }

          + spec {
              + container_concurrency = (known after apply)
              + service_account_name  = (known after apply)
              + serving_state         = (known after apply)
              + timeout_seconds       = (known after apply)

              + containers {
                  + image = "europe-docker.pkg.dev/kyma-project/prod/test-infra/searchgithubissue:v20230202-40569193"

                  + env {
                      + name  = "APPLICATION_NAME"
                      + value = "secrets-leaks-detector"
                    }
                  + env {
                      + name  = "COMPONENT_NAME"
                      + value = "github-issue-finder"
                    }
                  + env {
                      + name  = "GITHUB_ORG"
                      + value = "neighbors-team"
                    }
                  + env {
                      + name  = "GITHUB_REPO"
                      + value = "leaks-test"
                    }
                  + env {
                      + name  = "LISTEN_PORT"
                      + value = "8080"
                    }
                  + env {
                      + name  = "PROJECT_ID"
                      + value = "sap-kyma-prow"
                    }
                  + env {
                      + name  = "TOOLS_GITHUB_TOKEN_PATH"
                      + value = "/etc/gh-token/trusted_default_kyma-bot-github-sap-token"
                    }

                  + ports {
                      + container_port = (known after apply)
                      + name           = (known after apply)
                      + protocol       = (known after apply)
                    }

                  + resources {
                      + limits   = (known after apply)
                      + requests = (known after apply)
                    }

                  + volume_mounts {
                      + mount_path = "/etc/gh-token"
                      + name       = "gh-tools-kyma-bot-token"
                    }
                }

              + volumes {
                  + name = "gh-tools-kyma-bot-token"

                  + secret {
                      + secret_name = "trusted_default_kyma-bot-github-sap-token"
                    }
                }
            }
        }

      + traffic {
          + latest_revision = (known after apply)
          + percent         = (known after apply)
          + revision_name   = (known after apply)
          + tag             = (known after apply)
          + url             = (known after apply)
        }
    }

  # google_cloud_run_service.secrets_leak_log_scanner will be created
  + resource "google_cloud_run_service" "secrets_leak_log_scanner" {
      + autogenerate_revision_name = false
      + id                         = (known after apply)
      + location                   = "europe-west3"
      + name                       = "secrets-leak-log-scanner"
      + project                    = (known after apply)
      + status                     = (known after apply)

      + metadata {
          + annotations      = {
              + "run.googleapis.com/client-name" = "terraform"
            }
          + generation       = (known after apply)
          + labels           = (known after apply)
          + namespace        = (known after apply)
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }

      + template {
          + metadata {
              + annotations      = (known after apply)
              + generation       = (known after apply)
              + labels           = (known after apply)
              + name             = (known after apply)
              + namespace        = (known after apply)
              + resource_version = (known after apply)
              + self_link        = (known after apply)
              + uid              = (known after apply)
            }

          + spec {
              + container_concurrency = (known after apply)
              + service_account_name  = (known after apply)
              + serving_state         = (known after apply)
              + timeout_seconds       = (known after apply)

              + containers {
                  + image = "europe-docker.pkg.dev/kyma-project/prod/test-infra/scanlogsforsecrets:v20230202-40569193"

                  + env {
                      + name  = "APPLICATION_NAME"
                      + value = "secrets-leaks-detector"
                    }
                  + env {
                      + name  = "COMPONENT_NAME"
                      + value = "secrets-leak-log-scanner"
                    }
                  + env {
                      + name  = "GCS_PREFIX"
                      + value = "gcsweb.build.kyma-project.io/gcs/"
                    }
                  + env {
                      + name  = "LISTEN_PORT"
                      + value = "8080"
                    }
                  + env {
                      + name  = "PROJECT_ID"
                      + value = "sap-kyma-prow"
                    }

                  + ports {
                      + container_port = (known after apply)
                      + name           = (known after apply)
                      + protocol       = (known after apply)
                    }

                  + resources {
                      + limits   = (known after apply)
                      + requests = (known after apply)
                    }
                }
            }
        }

      + traffic {
          + latest_revision = (known after apply)
          + percent         = (known after apply)
          + revision_name   = (known after apply)
          + tag             = (known after apply)
          + url             = (known after apply)
        }
    }

  # google_cloud_run_service.slack_message_sender will be created
  + resource "google_cloud_run_service" "slack_message_sender" {
      + autogenerate_revision_name = false
      + id                         = (known after apply)
      + location                   = "europe-west3"
      + name                       = "slack-message-sender"
      + project                    = (known after apply)
      + status                     = (known after apply)

      + metadata {
          + annotations      = {
              + "run.googleapis.com/client-name" = "terraform"
            }
          + generation       = (known after apply)
          + labels           = (known after apply)
          + namespace        = (known after apply)
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }

      + template {
          + metadata {
              + annotations      = (known after apply)
              + generation       = (known after apply)
              + labels           = (known after apply)
              + name             = (known after apply)
              + namespace        = (known after apply)
              + resource_version = (known after apply)
              + self_link        = (known after apply)
              + uid              = (known after apply)
            }

          + spec {
              + container_concurrency = (known after apply)
              + service_account_name  = (known after apply)
              + serving_state         = (known after apply)
              + timeout_seconds       = (known after apply)

              + containers {
                  + image = "europe-docker.pkg.dev/kyma-project/prod/test-infra/slackmessagesender:v20230207-d59daeb0"

                  + env {
                      + name  = "APPLICATION_NAME"
                      + value = "slack-kyma-bot"
                    }
                  + env {
                      + name  = "COMPONENT_NAME"
                      + value = "slack-message-sender"
                    }
                  + env {
                      + name  = "PROJECT_ID"
                      + value = "sap-kyma-prow"
                    }
                  + env {
                      + name  = "SLACK_BASE_URL"
                      + value = "https://slack.com/api"
                    }
                  + env {
                      + name  = "SLACK_CHANNEL_ID"
                      + value = "C01KSP10MB5"
                    }
                  + env {
                      + name  = "SLACK_TOKEN_PATH"
                      + value = "/etc/slack-secret/common-slack-bot-token"
                    }

                  + ports {
                      + container_port = (known after apply)
                      + name           = (known after apply)
                      + protocol       = (known after apply)
                    }

                  + resources {
                      + limits   = (known after apply)
                      + requests = (known after apply)
                    }

                  + volume_mounts {
                      + mount_path = "/etc/slack-secret"
                      + name       = "slack-token"
                    }
                }

              + volumes {
                  + name = "slack-token"

                  + secret {
                      + secret_name = "common-slack-bot-token"
                    }
                }
            }
        }

      + traffic {
          + latest_revision = (known after apply)
          + percent         = (known after apply)
          + revision_name   = (known after apply)
          + tag             = (known after apply)
          + url             = (known after apply)
        }
    }

  # google_cloud_run_service_iam_policy.gcs_bucket_mover will be created
  + resource "google_cloud_run_service_iam_policy" "gcs_bucket_mover" {
      + etag        = (known after apply)
      + id          = (known after apply)
      + location    = "europe-west3"
      + policy_data = (known after apply)
      + project     = (known after apply)
      + service     = "gcs-bucket-mover"
    }

  # google_cloud_run_service_iam_policy.github_issue_creator will be created
  + resource "google_cloud_run_service_iam_policy" "github_issue_creator" {
      + etag        = (known after apply)
      + id          = (known after apply)
      + location    = "europe-west3"
      + policy_data = (known after apply)
      + project     = (known after apply)
      + service     = "github-issue-creator"
    }

  # google_cloud_run_service_iam_policy.github_issue_finder will be created
  + resource "google_cloud_run_service_iam_policy" "github_issue_finder" {
      + etag        = (known after apply)
      + id          = (known after apply)
      + location    = "europe-west3"
      + policy_data = (known after apply)
      + project     = (known after apply)
      + service     = "github-issue-finder"
    }

  # google_cloud_run_service_iam_policy.secrets_leak_log_scanner will be created
  + resource "google_cloud_run_service_iam_policy" "secrets_leak_log_scanner" {
      + etag        = (known after apply)
      + id          = (known after apply)
      + location    = "europe-west3"
      + policy_data = (known after apply)
      + project     = (known after apply)
      + service     = "secrets-leak-log-scanner"
    }

  # google_cloud_run_service_iam_policy.slack_message_sender will be created
  + resource "google_cloud_run_service_iam_policy" "slack_message_sender" {
      + etag        = (known after apply)
      + id          = (known after apply)
      + location    = "europe-west3"
      + policy_data = (known after apply)
      + project     = (known after apply)
      + service     = "slack-message-sender"
    }

  # google_eventarc_trigger.secrets_leak_detector_workflow will be created
  + resource "google_eventarc_trigger" "secrets_leak_detector_workflow" {
      + conditions      = (known after apply)
      + create_time     = (known after apply)
      + etag            = (known after apply)
      + id              = (known after apply)
      + labels          = {
          + "application" = "secrets_leak_detector"
        }
      + location        = "europe-west3"
      + name            = "secrets-leak-detector"
      + project         = (known after apply)
      + service_account = (known after apply)
      + uid             = (known after apply)
      + update_time     = (known after apply)

      + destination {
          + workflow = (known after apply)
        }

      + matching_criteria {
          + attribute = "type"
          + value     = "google.cloud.pubsub.topic.v1.messagePublished"
        }

      + transport {
          + pubsub {
              + subscription = (known after apply)
              + topic        = "projects/sap-kyma-prow/topics/prowjobs"
            }
        }
    }

  # google_monitoring_alert_policy.gcs_bucket_mover will be created
  + resource "google_monitoring_alert_policy" "gcs_bucket_mover" {
      + combiner              = "OR"
      + creation_record       = (known after apply)
      + display_name          = "gcs-bucket-mover-error-logged"
      + enabled               = true
      + id                    = (known after apply)
      + name                  = (known after apply)
      + notification_channels = [
          + "projects/sap-kyma-prow/notificationChannels/5909844679104799956",
        ]
      + project               = (known after apply)
      + user_labels           = {
          + "app"       = "secrets-leak-detector"
          + "component" = "gcs-bucket-mover"
        }

      + alert_strategy {
          + auto_close = "345600s"

          + notification_rate_limit {
              + period = "21600s"
            }
        }

      + conditions {
          + display_name = "error-log-message"
          + name         = (known after apply)

          + condition_matched_log {
              + filter = "resource.type=cloud_run_revision AND severity>=ERROR AND jsonPayload.component=gcs-bucket-mover AND labels.io.kyma.app=secrets-leaks-detector"
            }
        }
    }

  # google_monitoring_alert_policy.github_issue_creator will be created
  + resource "google_monitoring_alert_policy" "github_issue_creator" {
      + combiner              = "OR"
      + creation_record       = (known after apply)
      + display_name          = "github-issue-creator-error-logged"
      + enabled               = true
      + id                    = (known after apply)
      + name                  = (known after apply)
      + notification_channels = [
          + "projects/sap-kyma-prow/notificationChannels/5909844679104799956",
        ]
      + project               = (known after apply)
      + user_labels           = {
          + "app"       = "secrets-leak-detector"
          + "component" = "github-issue-creator"
        }

      + alert_strategy {
          + auto_close = "345600s"

          + notification_rate_limit {
              + period = "21600s"
            }
        }

      + conditions {
          + display_name = "error-log-message"
          + name         = (known after apply)

          + condition_matched_log {
              + filter = "resource.type=cloud_run_revision AND severity>=ERROR AND jsonPayload.component=github-issue-creator AND labels.io.kyma.app=secrets-leaks-detector"
            }
        }
    }

  # google_monitoring_alert_policy.github_issue_finder will be created
  + resource "google_monitoring_alert_policy" "github_issue_finder" {
      + combiner              = "OR"
      + creation_record       = (known after apply)
      + display_name          = "github-issue-finder-error-logged"
      + enabled               = true
      + id                    = (known after apply)
      + name                  = (known after apply)
      + notification_channels = [
          + "projects/sap-kyma-prow/notificationChannels/5909844679104799956",
        ]
      + project               = (known after apply)
      + user_labels           = {
          + "app"       = "secrets-leak-detector"
          + "component" = "github-issue-finder"
        }

      + alert_strategy {
          + auto_close = "345600s"

          + notification_rate_limit {
              + period = "21600s"
            }
        }

      + conditions {
          + display_name = "error-log-message"
          + name         = (known after apply)

          + condition_matched_log {
              + filter = "resource.type=cloud_run_revision AND severity>=ERROR AND jsonPayload.component=github-issue-finder AND labels.io.kyma.app=secrets-leaks-detector"
            }
        }
    }

  # google_monitoring_alert_policy.secrets_leak_log_scanner will be created
  + resource "google_monitoring_alert_policy" "secrets_leak_log_scanner" {
      + combiner              = "OR"
      + creation_record       = (known after apply)
      + display_name          = "secrets-leak-log-scanner-error-logged"
      + enabled               = true
      + id                    = (known after apply)
      + name                  = (known after apply)
      + notification_channels = [
          + "projects/sap-kyma-prow/notificationChannels/5909844679104799956",
        ]
      + project               = (known after apply)
      + user_labels           = {
          + "app"       = "secrets-leak-detector"
          + "component" = "secrets-leak-log-scanner"
        }

      + alert_strategy {
          + auto_close = "345600s"

          + notification_rate_limit {
              + period = "21600s"
            }
        }

      + conditions {
          + display_name = "error-log-message"
          + name         = (known after apply)

          + condition_matched_log {
              + filter = "resource.type=cloud_run_revision AND severity>=ERROR AND jsonPayload.component=secrets-leak-log-scanner AND labels.io.kyma.app=secrets-leaks-detector"
            }
        }
    }

  # google_monitoring_alert_policy.slack_message_sender will be created
  + resource "google_monitoring_alert_policy" "slack_message_sender" {
      + combiner              = "OR"
      + creation_record       = (known after apply)
      + display_name          = "slack-message-sender-error-logged"
      + enabled               = true
      + id                    = (known after apply)
      + name                  = (known after apply)
      + notification_channels = [
          + "projects/sap-kyma-prow/notificationChannels/5909844679104799956",
        ]
      + project               = (known after apply)
      + user_labels           = {
          + "app"       = "secrets-leak-detector"
          + "component" = "slack-message-sender"
        }

      + alert_strategy {
          + auto_close = "345600s"

          + notification_rate_limit {
              + period = "21600s"
            }
        }

      + conditions {
          + display_name = "error-log-message"
          + name         = (known after apply)

          + condition_matched_log {
              + filter = "resource.type=cloud_run_revision AND severity>=ERROR AND jsonPayload.component=slack-message-sender AND labels.io.kyma.app=secrets-leaks-detector"
            }
        }
    }

  # google_project_iam_member.project_log_writer will be created
  + resource "google_project_iam_member" "project_log_writer" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "projects/sap-kyma-prow"
      + role    = "roles/logging.logWriter"
    }

  # google_project_iam_member.project_workflows_invoker will be created
  + resource "google_project_iam_member" "project_workflows_invoker" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "projects/sap-kyma-prow"
      + role    = "roles/workflows.invoker"
    }

  # google_secret_manager_secret_iam_member.gh_issue_creator_gh_tools_kyma_bot_token_accessor will be created
  + resource "google_secret_manager_secret_iam_member" "gh_issue_creator_gh_tools_kyma_bot_token_accessor" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = (known after apply)
      + project   = (known after apply)
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = "trusted_default_kyma-bot-github-sap-token"
    }

  # google_secret_manager_secret_iam_member.gh_issue_finder_gh_tools_kyma_bot_token_accessor will be created
  + resource "google_secret_manager_secret_iam_member" "gh_issue_finder_gh_tools_kyma_bot_token_accessor" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = (known after apply)
      + project   = (known after apply)
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = "trusted_default_kyma-bot-github-sap-token"
    }

  # google_secret_manager_secret_iam_member.slack_msg_sender_common_slack_bot_token_accessor will be created
  + resource "google_secret_manager_secret_iam_member" "slack_msg_sender_common_slack_bot_token_accessor" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = (known after apply)
      + project   = (known after apply)
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = "common-slack-bot-token"
    }

  # google_service_account.gcs_bucket_mover will be created
  + resource "google_service_account" "gcs_bucket_mover" {
      + account_id  = "gcs-bucket-mover"
      + description = "Identity of cloud run instance running gcs bucket mover service."
      + disabled    = false
      + email       = (known after apply)
      + id          = (known after apply)
      + member      = (known after apply)
      + name        = (known after apply)
      + project     = (known after apply)
      + unique_id   = (known after apply)
    }

  # google_service_account.github_issue_creator will be created
  + resource "google_service_account" "github_issue_creator" {
      + account_id  = "github-issue-creator"
      + description = "Identity of cloud run instance running github issue creator service."
      + disabled    = false
      + email       = (known after apply)
      + id          = (known after apply)
      + member      = (known after apply)
      + name        = (known after apply)
      + project     = (known after apply)
      + unique_id   = (known after apply)
    }

  # google_service_account.github_issue_finder will be created
  + resource "google_service_account" "github_issue_finder" {
      + account_id  = "github-issue-finder"
      + description = "Identity of cloud run instance running github issue finder service."
      + disabled    = false
      + email       = (known after apply)
      + id          = (known after apply)
      + member      = (known after apply)
      + name        = (known after apply)
      + project     = (known after apply)
      + unique_id   = (known after apply)
    }

  # google_service_account.secrets_leak_detector will be created
  + resource "google_service_account" "secrets_leak_detector" {
      + account_id  = "secrets-leak-detector"
      + description = "Identity of secrets leak detector application."
      + disabled    = false
      + email       = (known after apply)
      + id          = (known after apply)
      + member      = (known after apply)
      + name        = (known after apply)
      + project     = (known after apply)
      + unique_id   = (known after apply)
    }

  # google_service_account.secrets_leak_log_scanner will be created
  + resource "google_service_account" "secrets_leak_log_scanner" {
      + account_id  = "secrets-leak-log-scanner"
      + description = "Identity of cloud run instance running log scanner service."
      + disabled    = false
      + email       = (known after apply)
      + id          = (known after apply)
      + member      = (known after apply)
      + name        = (known after apply)
      + project     = (known after apply)
      + unique_id   = (known after apply)
    }

  # google_service_account.slack_message_sender will be created
  + resource "google_service_account" "slack_message_sender" {
      + account_id  = "slack-message-sender"
      + description = "Identity of cloud run instance running slack message sender service."
      + disabled    = false
      + email       = (known after apply)
      + id          = (known after apply)
      + member      = (known after apply)
      + name        = (known after apply)
      + project     = (known after apply)
      + unique_id   = (known after apply)
    }

  # google_storage_bucket.kyma_prow_logs_secured will be created
  + resource "google_storage_bucket" "kyma_prow_logs_secured" {
      + force_destroy               = true
      + id                          = (known after apply)
      + location                    = "EU"
      + name                        = "kyma-prow-logs-secured"
      + project                     = (known after apply)
      + public_access_prevention    = "enforced"
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + uniform_bucket_level_access = true
      + url                         = (known after apply)

      + custom_placement_config {
          + data_locations = [
              + "EUROPE-WEST1",
              + "EUROPE-WEST4",
            ]
        }

      + versioning {
          + enabled = (known after apply)
        }

      + website {
          + main_page_suffix = (known after apply)
          + not_found_page   = (known after apply)
        }
    }

  # google_storage_bucket_iam_member.kyma_prow_logs_secured_object_admin will be created
  + resource "google_storage_bucket_iam_member" "kyma_prow_logs_secured_object_admin" {
      + bucket = "kyma-prow-logs-secured"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = (known after apply)
      + role   = "roles/storage.objectAdmin"
    }

  # google_storage_bucket_iam_member.kyma_prow_logs_viewer will be created
  + resource "google_storage_bucket_iam_member" "kyma_prow_logs_viewer" {
      + bucket = "kyma-prow-logs"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = (known after apply)
      + role   = "roles/storage.objectViewer"
    }

  # google_storage_bucket_iam_member.secrets_leak_detector will be created
  + resource "google_storage_bucket_iam_member" "secrets_leak_detector" {
      + bucket = "kyma-prow-logs"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = (known after apply)
      + role   = "roles/storage.objectViewer"
    }

  # google_workflows_workflow.secrets_leak_detector will be created
  + resource "google_workflows_workflow" "secrets_leak_detector" {
      + create_time     = (known after apply)
      + description     = "Workflow is triggered by message published to prowjobs PubSub topic and scans prowjobs logs for secrets."
      + id              = (known after apply)
      + name            = "secrets-leak-detector"
      + name_prefix     = (known after apply)
      + project         = (known after apply)
      + region          = "europe-west3"
      + revision_id     = (known after apply)
      + service_account = (known after apply)
      + source_contents = (known after apply)
      + state           = (known after apply)
      + update_time     = (known after apply)
    }

Plan: 32 to add, 0 to change, 0 to destroy.
google_service_account.gcs_bucket_mover: Creating...
google_service_account.github_issue_creator: Creating...
google_service_account.secrets_leak_log_scanner: Creating...
google_service_account.secrets_leak_detector: Creating...
google_service_account.slack_message_sender: Creating...
google_monitoring_alert_policy.github_issue_finder: Creating...
google_monitoring_alert_policy.gcs_bucket_mover: Creating...
google_monitoring_alert_policy.secrets_leak_log_scanner: Creating...
google_monitoring_alert_policy.github_issue_creator: Creating...
google_storage_bucket.kyma_prow_logs_secured: Creating...
google_service_account.gcs_bucket_mover: Creation complete after 1s [id=projects/sap-kyma-prow/serviceAccounts/gcs-bucket-mover@sap-kyma-prow.iam.gserviceaccount.com]
google_service_account.github_issue_finder: Creating...
google_service_account.slack_message_sender: Creation complete after 1s [id=projects/sap-kyma-prow/serviceAccounts/slack-message-sender@sap-kyma-prow.iam.gserviceaccount.com]
google_monitoring_alert_policy.slack_message_sender: Creating...
google_service_account.secrets_leak_detector: Creation complete after 1s [id=projects/sap-kyma-prow/serviceAccounts/secrets-leak-detector@sap-kyma-prow.iam.gserviceaccount.com]
google_cloud_run_service.gcs_bucket_mover: Creating...
google_service_account.secrets_leak_log_scanner: Creation complete after 1s [id=projects/sap-kyma-prow/serviceAccounts/secrets-leak-log-scanner@sap-kyma-prow.iam.gserviceaccount.com]
google_storage_bucket_iam_member.kyma_prow_logs_viewer: Creating...
google_service_account.github_issue_creator: Creation complete after 1s [id=projects/sap-kyma-prow/serviceAccounts/github-issue-creator@sap-kyma-prow.iam.gserviceaccount.com]
google_secret_manager_secret_iam_member.slack_msg_sender_common_slack_bot_token_accessor: Creating...
google_service_account.github_issue_finder: Creation complete after 0s [id=projects/sap-kyma-prow/serviceAccounts/github-issue-finder@sap-kyma-prow.iam.gserviceaccount.com]
data.google_iam_policy.run_invoker: Reading...
data.google_iam_policy.run_invoker: Read complete after 0s [id=735823064]
google_storage_bucket_iam_member.secrets_leak_detector: Creating...
google_storage_bucket.kyma_prow_logs_secured: Creation complete after 1s [id=kyma-prow-logs-secured]
google_project_iam_member.project_workflows_invoker: Creating...
google_project_iam_member.project_log_writer: Creating...
google_monitoring_alert_policy.github_issue_finder: Creation complete after 2s [id=projects/sap-kyma-prow/alertPolicies/15999866418925089607]
google_cloud_run_service.secrets_leak_log_scanner: Creating...
google_monitoring_alert_policy.secrets_leak_log_scanner: Creation complete after 4s [id=projects/sap-kyma-prow/alertPolicies/15677332264241438988]
google_secret_manager_secret_iam_member.gh_issue_creator_gh_tools_kyma_bot_token_accessor: Creating...
google_secret_manager_secret_iam_member.gh_issue_finder_gh_tools_kyma_bot_token_accessor: Creating...
google_storage_bucket_iam_member.kyma_prow_logs_secured_object_admin: Creating...
google_monitoring_alert_policy.github_issue_creator: Creation complete after 6s [id=projects/sap-kyma-prow/alertPolicies/9821277804074506500]
google_monitoring_alert_policy.gcs_bucket_mover: Creation complete after 8s [id=projects/sap-kyma-prow/alertPolicies/5579410898419231270]
google_cloud_run_service.gcs_bucket_mover: Creation complete after 8s [id=locations/europe-west3/namespaces/sap-kyma-prow/services/gcs-bucket-mover]
google_cloud_run_service_iam_policy.gcs_bucket_mover: Creating...
google_cloud_run_service.secrets_leak_log_scanner: Creation complete after 8s [id=locations/europe-west3/namespaces/sap-kyma-prow/services/secrets-leak-log-scanner]
google_cloud_run_service_iam_policy.secrets_leak_log_scanner: Creating...
google_monitoring_alert_policy.slack_message_sender: Still creating... [10s elapsed]
google_monitoring_alert_policy.slack_message_sender: Creation complete after 10s [id=projects/sap-kyma-prow/alertPolicies/16641435238811176146]
google_storage_bucket_iam_member.kyma_prow_logs_viewer: Still creating... [10s elapsed]
google_storage_bucket_iam_member.secrets_leak_detector: Still creating... [10s elapsed]
google_storage_bucket_iam_member.kyma_prow_logs_secured_object_admin: Creation complete after 7s [id=b/kyma-prow-logs-secured/roles/storage.objectAdmin/serviceAccount:gcs-bucket-mover@sap-kyma-prow.iam.gserviceaccount.com]
google_storage_bucket_iam_member.kyma_prow_logs_viewer: Creation complete after 12s [id=b/kyma-prow-logs/roles/storage.objectViewer/serviceAccount:gcs-bucket-mover@sap-kyma-prow.iam.gserviceaccount.com]
google_storage_bucket_iam_member.secrets_leak_detector: Creation complete after 12s [id=b/kyma-prow-logs/roles/storage.objectViewer/serviceAccount:secrets-leak-detector@sap-kyma-prow.iam.gserviceaccount.com]
╷
│ Error: Error setting IAM policy for cloudrun service "v1/projects/sap-kyma-prow/locations/europe-west3/services/gcs-bucket-mover": googleapi: Error 403: Permission 'run.services.setIamPolicy' denied on resource 'projects/sap-kyma-prow/locations/europe-west3/services/gcs-bucket-mover' (or resource may not exist).
│ 
│   with google_cloud_run_service_iam_policy.gcs_bucket_mover,
│   on gcs-bucket-mover.tf line 70, in resource "google_cloud_run_service_iam_policy" "gcs_bucket_mover":
│   70: resource "google_cloud_run_service_iam_policy" "gcs_bucket_mover" {
│ 
╵
╷
│ Error: Error applying IAM policy for secretmanager secret "projects/sap-kyma-prow/secrets/trusted_default_kyma-bot-github-sap-token": Error setting IAM policy for secretmanager secret "projects/sap-kyma-prow/secrets/trusted_default_kyma-bot-github-sap-token": googleapi: Error 403: Permission 'secretmanager.secrets.setIamPolicy' denied for resource 'projects/sap-kyma-prow/secrets/trusted_default_kyma-bot-github-sap-token' (or it may not exist).
│ 
│   with google_secret_manager_secret_iam_member.gh_issue_creator_gh_tools_kyma_bot_token_accessor,
│   on github-issue-creator.tf line 6, in resource "google_secret_manager_secret_iam_member" "gh_issue_creator_gh_tools_kyma_bot_token_accessor":
│    6: resource "google_secret_manager_secret_iam_member" "gh_issue_creator_gh_tools_kyma_bot_token_accessor" {
│ 
╵
╷
│ Error: Error applying IAM policy for secretmanager secret "projects/sap-kyma-prow/secrets/trusted_default_kyma-bot-github-sap-token": Error setting IAM policy for secretmanager secret "projects/sap-kyma-prow/secrets/trusted_default_kyma-bot-github-sap-token": googleapi: Error 403: Permission 'secretmanager.secrets.setIamPolicy' denied for resource 'projects/sap-kyma-prow/secrets/trusted_default_kyma-bot-github-sap-token' (or it may not exist).
│ 
│   with google_secret_manager_secret_iam_member.gh_issue_finder_gh_tools_kyma_bot_token_accessor,
│   on github-issue-finder.tf line 6, in resource "google_secret_manager_secret_iam_member" "gh_issue_finder_gh_tools_kyma_bot_token_accessor":
│    6: resource "google_secret_manager_secret_iam_member" "gh_issue_finder_gh_tools_kyma_bot_token_accessor" {
│ 
╵
╷
│ Error: Request `Create IAM Members roles/logging.logWriter serviceAccount:secrets-leak-detector@sap-kyma-prow.iam.gserviceaccount.com for project "projects/sap-kyma-prow"` returned error: Batch request and retried single request "Create IAM Members roles/logging.logWriter serviceAccount:secrets-leak-detector@sap-kyma-prow.iam.gserviceaccount.com for project \"projects/sap-kyma-prow\"" both failed. Final error: Error applying IAM policy for project "projects/sap-kyma-prow": Error setting IAM policy for project "projects/sap-kyma-prow": googleapi: Error 403: Policy update access denied., forbidden
│ 
│   with google_project_iam_member.project_log_writer,
│   on secrets-leak-detector.tf line 15, in resource "google_project_iam_member" "project_log_writer":
│   15: resource "google_project_iam_member" "project_log_writer" {
│ 
╵
╷
│ Error: Request `Create IAM Members roles/workflows.invoker serviceAccount:secrets-leak-detector@sap-kyma-prow.iam.gserviceaccount.com for project "projects/sap-kyma-prow"` returned error: Batch request and retried single request "Create IAM Members roles/workflows.invoker serviceAccount:secrets-leak-detector@sap-kyma-prow.iam.gserviceaccount.com for project \"projects/sap-kyma-prow\"" both failed. Final error: Error applying IAM policy for project "projects/sap-kyma-prow": Error setting IAM policy for project "projects/sap-kyma-prow": googleapi: Error 403: Policy update access denied., forbidden
│ 
│   with google_project_iam_member.project_workflows_invoker,
│   on secrets-leak-detector.tf line 22, in resource "google_project_iam_member" "project_workflows_invoker":
│   22: resource "google_project_iam_member" "project_workflows_invoker" {
│ 
╵
╷
│ Error: Error setting IAM policy for cloudrun service "v1/projects/sap-kyma-prow/locations/europe-west3/services/secrets-leak-log-scanner": googleapi: Error 403: Permission 'run.services.setIamPolicy' denied on resource 'projects/sap-kyma-prow/locations/europe-west3/services/secrets-leak-log-scanner' (or resource may not exist).
│ 
│   with google_cloud_run_service_iam_policy.secrets_leak_log_scanner,
│   on secrets-leak-log-scanner.tf line 52, in resource "google_cloud_run_service_iam_policy" "secrets_leak_log_scanner":
│   52: resource "google_cloud_run_service_iam_policy" "secrets_leak_log_scanner" {
│ 
╵
╷
│ Error: Error applying IAM policy for secretmanager secret "projects/sap-kyma-prow/secrets/common-slack-bot-token": Error setting IAM policy for secretmanager secret "projects/sap-kyma-prow/secrets/common-slack-bot-token": googleapi: Error 403: Permission 'secretmanager.secrets.setIamPolicy' denied for resource 'projects/sap-kyma-prow/secrets/common-slack-bot-token' (or it may not exist).
│ 
│   with google_secret_manager_secret_iam_member.slack_msg_sender_common_slack_bot_token_accessor,
│   on slack-message-sender.tf line 6, in resource "google_secret_manager_secret_iam_member" "slack_msg_sender_common_slack_bot_token_accessor":
│    6: resource "google_secret_manager_secret_iam_member" "slack_msg_sender_common_slack_bot_token_accessor" {
│ 
╵

```

</details>

<!-- github-comment: {"Command":"apply","PRNumber":7013,"Program":"tfcmt","SHA1":"166cf9bb45a60f7f110b873b064baa5cc06aebc5","Vars":{}} -->